// Graph_BFS_DFS.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
#include <locale>
//#include <string>
#include <fstream>
#include <set>
#include "BFS.h"
//#include "DFS.h"
#include "Graph.h"
using namespace std;

int main()
{
    //setlocale(LC_ALL, "ru");
    ifstream file("./testGraph.txt");
    if (!file) {
        std::cerr << "Ошибка открытия файла\n";
        return 1;
    }

    const int BUFFER_SIZE = 64;
    char buffer[BUFFER_SIZE];

    while (file.getline(buffer, BUFFER_SIZE)) {
        std::cout << buffer << '\n';
    }

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
