// work with vector.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//задача номер 1 : выделить паямть, записать массив чисел в первую очередь, если будет хотя бы это уже хорошо 

#include <iostream>
#include "vector.h"
using namespace std;

int main()
{
        Array arr;// Здесь вызовется конструктор
        arr[0] = 1;
        return 0; // А здесь вызовется деструктор
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
